Repository: ShahbazCoder1/QuizBot
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: bn, es, hi, te

source: Here are the available commands: /start - Begin with your quiz /help - Show this help message /about - See a description of the bot /stop- Stop the quiz /feedback - Send feedback /language - Set the bot's language
bn: উপলব্ধ কমান্ডগুলি এখানে: /start - আপনার কুইজ শুরু করুন /help - এই সাহায্য বার্তাটি দেখান /about - বটের একটি বিবরণ দেখুন /stop- কুইজ বন্ধ করুন /feedback - প্রতিক্রিয়া পাঠান /language - বটের ভাষা সেট করুন
es: Estos son los comandos disponibles: /start - Comenzar con tu quiz /help - Mostrar este mensaje de ayuda /about - Ver una descripciÃ³n del bot /stop - Detener el quiz /feedback - Enviar comentarios /language - Establecer el idioma del bot
hi: उपलब्ध कमांड इस प्रकार हैं: /start - अपनी क्विज़ शुरू करें /help - यह सहायता संदेश दिखाएँ /about - बॉट का विवरण देखें /stop- क्विज़ रोकें /feedback - प्रतिक्रिया भेजें /language - बॉट की भाषा सेट करें
te: అందుబాటులో ఉన్న ఆదేశాలు ఇక్కడ ఉన్నాయి: /start - మీ క్విజ్‌తో ప్రారంభించండి /help - ఈ సహాయ సందేశాన్ని చూపించు /about - బాట్ యొక్క వివరణను చూడండి /stop- క్విజ్‌ను ఆపండి /feedback - అభిప్రాయాన్ని పంపండి /language - బాట్ యొక్క భాషను సెట్ చేయండి

source: 📚 You can use this bot to take quizzes on different subjects across various topics. You can also adjust the difficulty level according to your convenience. 🏅 Your score will be displayed after you finish the quiz. NOTE: This quiz is created with AI, and while we strive for accuracy, there's always a chance for a mistake. 𝗪𝗶𝘁𝗵 ❤️ 𝗽𝗿𝗼𝘂𝗱𝗹𝘆 𝗺𝗮𝗱𝗲 𝗶𝗻 𝗜𝗻𝗱𝗶𝗮 🇮🇳
bn: 📚 আপনি বিভিন্ন বিষয়ের উপর বিভিন্ন বিষয়ে কুইজ নেওয়ার জন্য এই বটটি ব্যবহার করতে পারেন। আপনি আপনার সুবিধা অনুযায়ী অসুবিধার স্তরও সামঞ্জস্য করতে পারেন। 🏅 আপনার স্কোর কুইজ শেষ করার পরে প্রদর্শিত হবে। বিঃদ্রঃ: এই কুইজটি AI দিয়ে তৈরি করা হয়েছে এবং আমরা যদিও নির্ভুলতার জন্য সর্বাত্মক চেষ্টা করি, তবুও ভুল হওয়ার সম্ভাবনা সবসময় থাকে। ❤️ সহকারে ভারতে তৈরি 🇮🇳
hi: 📚 आप विभिन्न विषयों पर विभिन्न विषयों पर क्विज़ लेने के लिए इस बॉट का उपयोग कर सकते हैं। आप अपनी सुविधानुसार कठिनाई स्तर को भी समायोजित कर सकते हैं। 🏅 आपकी क्विज़ समाप्त करने के बाद आपका स्कोर प्रदर्शित किया जाएगा। ध्यान दें: यह क्विज़ AI से बनाई गई है, और जबकि हम सटीकता के लिए प्रयास करते हैं, हमेशा गलती की संभावना रहती है। 𝗪𝗶𝘁𝗵 ❤️ 𝗽𝗿𝗼𝘂𝗱𝗹𝘆 𝗺𝗮𝗱𝗲 𝗶𝗻 𝗜𝗻𝗱𝗶𝗮 🇮🇳
te: 📚 వివిధ అంశాలపై క్విజ్‌లు చేయడానికి మీరు ఈ బాట్‌ని ఉపయోగించవచ్చు. మీ సౌలభ్యం ప్రకారం కష్ట స్థాయిని కూడా మీరు సర్దుబాటు చేయవచ్చు. 🏅 మీరు క్విజ్‌ను పూర్తి చేసిన తర్వాత మీ స్కోర్ ప్రదర్శించబడుతుంది. గమనిక: ఈ క్విజ్ AIతో సృష్టించబడింది మరియు మేము ఖచ్చితత్వం కోసం ప్రయత్నిస్తున్నప్పటికీ, ఎల్లప్పుడూ తప్పు జరిగే అవకాశం ఉంది. ❤️ తో గర్వంగా భారతదేశంలో తయారు చేయబడింది 🇮🇳

source: Hindi
bn: হিন্দি
hi: हिंदी
te: హిందీ

source: Spanish
bn: স্প্যানিশ
es: EspaÃ±ol
hi: स्पेनिश
te: స్పానిష్

source: Bengali
bn: বাংলা
hi: बंगाली
te: బెంగాలీ

source: Telugu
bn: তেলেগু
hi: तेलुगू
te: తెలుగు

source: Mandarin Chinese
bn: ম্যান্ডারিন চীনা
hi: मंदारिन चीनी
te: మాండరిన్ చైనీస్

source: Select the Language for the Bot:
bn: বটের জন্য ভাষা নির্বাচন করুন:
es: Selecciona el idioma para el Bot:
hi: बॉट के लिए भाषा चुनें:
te: బాట్ కోసం భాషను ఎంచుకోండి:

source: Enter your Feedback message: If you don't want to send Feedback, type /cancel
bn: আপনার প্রতিক্রিয়া বার্তা লিখুন: আপনি যদি প্রতিক্রিয়া পাঠাতে না চান, /cancel টাইপ করুন
es: Introduce tu mensaje de comentarios: Si no quieres enviar comentarios, escribe /cancel
hi: अपना प्रतिक्रिया संदेश दर्ज करें: यदि आप प्रतिक्रिया नहीं भेजना चाहते हैं, तो /cancel टाइप करें
te: మీ అభిప్రాయ సందేశాన్ని నమోదు చేయండి: మీరు అభిప్రాయాన్ని పంపకూడదనుకుంటే, /cancel అని టైప్ చేయండి

source: Feedback cancelled.
bn: প্রতিক্রিয়া বাতিল।
es: Comentarios cancelados.
hi: प्रतिक्रिया रद्द कर दी गई।
te: అభిప్రాయం రద్దు చేయబడింది.

source: Thank you for your feedback!
bn: আপনার প্রতিক্রিয়ার জন্য ধন্যবাদ!
es: Â¡Gracias por tus comentarios!
hi: आपकी प्रतिक्रिया के लिए धन्यवाद!
te: మీ అభిప్రాయానికి ధన్యవాదాలు!

source: No active quiz to stop.
bn: বন্ধ করার জন্য কোন সক্রিয় কুইজ নেই।
es: No hay ningÃºn cuestionario activo que detener.
hi: रोकने के लिए कोई सक्रिय क्विज़ नहीं है।
te: ఆపడానికి యాక్టివ్ క్విజ్ లేదు.

source: No active quiz session found.
bn: কোন সক্রিয় কুইজ সেশন পাওয়া যায়নি।
es: No se encontrÃ³ ninguna sesiÃ³n de cuestionario activa.
hi: कोई सक्रिय क्विज़ सत्र नहीं मिला।
te: యాక్టివ్ క్విజ్ సెషన్ కనుగొనబడలేదు.

source: The Quizly Quiz adventure begins now!
bn: কুইজলি কুইজ অ্যাডভেঞ্চার এখন শুরু হচ্ছে!
es: Â¡La aventura del Quizly Quiz comienza ahora!
hi: क्विज़ली क्विज़ एडवेंचर अब शुरू होता है!
te: క్విజ్లీ క్విజ్ సాహసం ఇప్పుడు ప్రారంభమవుతుంది!

source: /Language
bn: /ভাষা
es: /Idioma
hi: /भाषा
te: /భాష

source: Continue
bn: চালিয়ে যান
es: Continuar
hi: जारी रखें
te: కొనసాగించు

source: Do you want to Change Quizly defualt language?
bn: আপনি কি কুইজলি ডিফল্ট ভাষা পরিবর্তন করতে চান?
es: Â¿Quieres cambiar el idioma predeterminado de Quizly?
hi: क्या आप क्विज़ली की डिफ़ॉल्ट भाषा बदलना चाहते हैं?
te: మీరు క్విజ్లీ డిఫాల్ట్ భాషను మార్చాలనుకుంటున్నారా?

source: Enter the subject you wish to take the quiz on:
bn: আপনি যে বিষয়ের উপর কুইজ নিতে চান তা লিখুন:
es: Introduce el tema sobre el que deseas realizar el cuestionario:
hi: वह विषय दर्ज करें जिस पर आप क्विज़ लेना चाहते हैं:
te: మీరు క్విజ్ తీసుకోవాలనుకుంటున్న సబ్జెక్ట్‌ను నమోదు చేయండి:

source: Enter the topic you wish to take a quiz on:
bn: আপনি যে বিষয়ের উপর কুইজ নিতে চান তা লিখুন:
es: Introduce el tema sobre el que deseas realizar un cuestionario:
hi: वह विषय दर्ज करें जिस पर आप क्विज़ लेना चाहते हैं:
te: మీరు క్విజ్ తీసుకోవాలనుకుంటున్న అంశాన్ని నమోదు చేయండి:

source: Invalid subject. Please enter a valid subject.
bn: অবৈধ বিষয়। দয়া করে একটি বৈধ বিষয় লিখুন।
es: Tema invÃ¡lido. Introduce un tema vÃ¡lido.
hi: अमान्य विषय। कृपया एक मान्य विषय दर्ज करें।
te: చెల్లని సబ్జెక్ట్. దయచేసి చెల్లుబాటు అయ్యే సబ్జెక్ట్‌ను నమోదు చేయండి.

source: Enter the level of the quiz:
bn: কুইজের স্তর লিখুন:
es: Introduce el nivel del cuestionario:
hi: क्विज़ का स्तर दर्ज करें:
te: క్విజ్ స్థాయిని నమోదు చేయండి:

source: Invalid topic for {subject}. Please enter a relevant topic.
bn: {subject} এর জন্য অবৈধ বিষয়। দয়া করে একটি প্রাসঙ্গিক বিষয় লিখুন।
es: Tema invÃ¡lido para {subject}. Introduce un tema relevante.
hi: {subject} के लिए अमान्य विषय। कृपया एक प्रासंगिक विषय दर्ज करें।
te: {subject} కోసం చెల్లని అంశం. దయచేసి సంబంధిత అంశాన్ని నమోదు చేయండి.

source: Generating quiz questions, please wait...
bn: কুইজ প্রশ্ন তৈরি হচ্ছে, দয়া করে অপেক্ষা করুন...
es: Generando preguntas del cuestionario, por favor espera...
hi: क्विज़ प्रश्न तैयार हो रहे हैं, कृपया प्रतीक्षा करें...
te: క్విజ్ ప్రశ్నలను రూపొందిస్తున్నాము, దయచేసి వేచి ఉండండి...

source: Generating quiz questions, please wait... 𝐍𝐨𝐭𝐞: 𝐓𝐡𝐢𝐬 𝐪𝐮𝐢𝐳 𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧𝐬 𝐢𝐬 𝐜𝐫𝐞𝐚𝐭𝐞𝐝 𝐰𝐢𝐭𝐡 𝐀𝐈, 𝐚𝐧𝐝 𝐰𝐡𝐢𝐥𝐞 𝐰𝐞 𝐬𝐭𝐫𝐢𝐯𝐞 𝐟𝐨𝐫 𝐚𝐜𝐜𝐮𝐫𝐚𝐜𝐲, 𝐭𝐡𝐞𝐫𝐞'𝐬 𝐚𝐥𝐰𝐚𝐲𝐬 𝐚 𝐜𝐡𝐚𝐧𝐜𝐞 𝐟𝐨𝐫 𝐚 𝐦𝐢𝐬𝐭𝐚𝐤𝐞.
bn: কুইজ প্রশ্ন তৈরি হচ্ছে, দয়া করে অপেক্ষা করুন... বিঃদ্রঃ: এই কুইজ প্রশ্নগুলি AI দিয়ে তৈরি করা হয়েছে এবং আমরা যদিও নির্ভুলতার জন্য সর্বাত্মক চেষ্টা করি, তবুও ভুল হওয়ার সম্ভাবনা সবসময় থাকে।
hi: क्विज़ प्रश्न तैयार हो रहे हैं, कृपया प्रतीक्षा करें... ध्यान दें: यह क्विज़ प्रश्न AI से बनाए गए हैं, और जबकि हम सटीकता के लिए प्रयास करते हैं, हमेशा गलती की संभावना रहती है।
te: క్విజ్ ప్రశ్నలను రూపొందిస్తున్నాము, దయచేసి వేచి ఉండండి... గమనిక: ఈ క్విజ్ ప్రశ్నలు AIతో సృష్టించబడ్డాయి మరియు మేము ఖచ్చితత్వం కోసం ప్రయత్నిస్తున్నప్పటికీ, ఎల్లప్పుడూ తప్పు జరిగే అవకాశం ఉంది.

source: Let's Begin
bn: চল শুরু করা যাক
es: Comencemos
hi: आइए शुरू करें
te: ప్రారంభిద్దాం

source: Congratulations! You have completed the quiz on {topic} 🎯 𝗬𝗼𝘂𝗿 𝘀𝗰𝗼𝗿𝗲: ✅ Correct answers: {cor} ❌ Incorrect answers: {incor}
bn: অভিনন্দন! আপনি {topic} এর উপর কুইজটি সম্পূর্ণ করেছেন 🎯 আপনার স্কোর: ✅ সঠিক উত্তর: {cor} ❌ ভুল উত্তর: {incor}
hi: बधाई हो! आपने {topic} पर क्विज़ पूरी कर ली है 🎯 आपका स्कोर: ✅ सही उत्तर: {cor} ❌ गलत उत्तर: {incor}
te: అభినందనలు! మీరు {topic} పై క్విజ్‌ను పూర్తి చేసారు 🎯 మీ స్కోర్: ✅ సరైన సమాధానాలు: {cor} ❌ తప్పు సమాధానాలు: {incor}

source: Here are some recommended videos to improve your knowledge on {topic}:
bn: {topic} সম্পর্কে আপনার জ্ঞান উন্নত করার জন্য এখানে কিছু প্রস্তাবিত ভিডিও রয়েছে:
es: AquÃ­ tienes algunos vÃ­deos recomendados para mejorar tus conocimientos sobre {topic}:
hi: {topic} पर अपने ज्ञान को बेहतर बनाने के लिए यहां कुछ अनुशंसित वीडियो दिए गए हैं:
te: {topic} పై మీ జ్ఞానాన్ని మెరుగుపరచడానికి ఇక్కడ కొన్ని సిఫార్సు చేయబడిన వీడియోలు ఉన్నాయి:

source: Great job! Your performance in the quiz on {topic} is outstanding! 🌟
bn: অসাধারণ কাজ! {topic} এর উপর কুইজে আপনার পারফরম্যান্স অসাধারণ! 🌟
hi: बहुत बढ़िया! {topic} पर क्विज़ में आपका प्रदर्शन उत्कृष्ट है! 🌟
te: చాలా బాగుంది! {topic} పై క్విజ్‌లో మీ పనితీరు అద్భుతమైనది! 🌟

source: English is set as your Default Language
bn: ইংরেজি আপনার ডিফল্ট ভাষা হিসেবে সেট করা হয়েছে
es: El inglÃ©s estÃ¡ configurado como tu idioma predeterminado
hi: अंग्रेजी आपकी डिफ़ॉल्ट भाषा के रूप में सेट है
te: ఇంగ్లీష్ మీ డిఫాల్ట్ భాషగా సెట్ చేయబడింది

source: {language_name} is set as your default language
bn: {language_name} আপনার ডিফল্ট ভাষা হিসেবে সেট করা হয়েছে
es: {language_name} estÃ¡ configurado como tu idioma predeterminado
hi: {language_name} आपकी डिफ़ॉल्ट भाषा के रूप में सेट है
te: {language_name} మీ డిఫాల్ట్ భాషగా సెట్ చేయబడింది

source: Invalid input. Please try again.
bn: অবৈধ ইনপুট। আবার চেষ্টা করুন।
es: Entrada invÃ¡lida. Por favor, intÃ©ntalo de nuevo.
hi: अमान्य इनपुट। कृपया पुनः प्रयास करें।
te: చెల్లని ఇన్‌పుట్. దయచేసి మళ్ళీ ప్రయత్నించండి.

source: Please use the provided buttons to interact with the bot.
bn: বটের সাথে যোগাযোগ করার জন্য দয়া করে প্রদত্ত বোতামগুলি ব্যবহার করুন।
es: Por favor, utiliza los botones proporcionados para interactuar con el bot.
hi: बॉट के साथ इंटरैक्ट करने के लिए कृपया दिए गए बटनों का उपयोग करें।
te: బాట్‌తో సంకర్షణ చెందడానికి దయచేసి అందించిన బటన్‌లను ఉపయోగించండి.

source: An error occurred. Please try again later.
bn: একটি ত্রুটি ঘটেছে। দয়া করে পরে আবার চেষ্টা করুন।
es: Se ha producido un error. Por favor, intÃ©ntalo de nuevo mÃ¡s tarde.
hi: एक त्रुटि हुई। कृपया बाद में पुनः प्रयास करें।
te: లోపం సంభవించింది. దయచేసి తరువాత మళ్ళీ ప్రయత్నించండి.

source: Mathematics
bn: গণিত
es: MatemÃ¡ticas
hi: गणित
te: గణితం

source: Physics
bn: পদার্থবিদ্যা
es: FÃ­sica
hi: भौतिक विज्ञान
te: భౌతిక శాస్త్రం

source: Chemistry
bn: রসায়ন
es: QuÃ­mica
hi: रसायन विज्ञान
te: రసాయన శాస్త్రం

source: Biology
bn: জীববিদ্যা
es: BiologÃ­a
hi: जीव विज्ञान
te: జీవశాస్త్రం

source: Computer Science
bn: কম্পিউটার বিজ্ঞান
es: Ciencias de la ComputaciÃ³n
hi: कंप्यूटर विज्ञान
te: కంప్యూటర్ సైన్స్

source: History
bn: ইতিহাস
es: Historia
hi: इतिहास
te: చరిత్ర

source: Geography
bn: ভূগোল
es: GeografÃ­a
hi: भूगोल
te: భూగోళ శాస్త్రం

source: Politics
bn: রাজনীতি
es: PolÃ­tica
hi: राजनीति विज्ञान
te: రాజకీయాలు

source: English
bn: ইংরেজি
es: InglÃ©s
hi: अंग्रेजी
te: ఆంగ్లం

source: General Knowledge
bn: সাধারণ জ্ঞান
es: Conocimientos Generales
hi: सामान्य ज्ञान
te: సాధారణ జ్ఞానం

source: Beginner
bn: প্রাথমিক
es: Principiante
hi: शुरुआती
te: బిగినర్స్

source: Intermediate
bn: মাধ্যমিক
es: Intermedio
hi: मध्यवर्ती
te: ఇంటర్మీడియట్

source: Advanced
bn: উন্নত
es: Avanzado
hi: उन्नत
te: అడ్వాన్స్డ్

source: ğŸ“š You can use this bot to take quizzes on different subjects across various topics. You can also adjust the difficulty level according to your convenience. ğŸ… Your score will be displayed after you finish the quiz. NOTE: This quiz is created with AI, and while we strive for accuracy, there's always a chance for a mistake. ğ—ªğ—¶ğ˜ğ—µ â¤ï¸ ğ—½ğ—¿ğ—¼ğ˜‚ğ—±ğ—¹ğ˜† ğ—ºğ—®ğ—±ğ—² ğ—¶ğ—» ğ—œğ—»ğ—±ğ—¶ğ—® ğŸ‡®ğŸ‡³
es: ğŸ“š Puedes usar este bot para realizar cuestionarios sobre diferentes temas en varios tÃ³picos. TambiÃ©n puedes ajustar el nivel de dificultad segÃºn tu conveniencia. ğŸ… Tu puntuaciÃ³n se mostrarÃ¡ despuÃ©s de que termines el cuestionario. NOTA: Este cuestionario estÃ¡ creado con IA, y aunque nos esforzamos por la precisiÃ³n, siempre existe la posibilidad de un error. Hecho con â¤ï¸ con orgullo en India ğŸ‡®ğŸ‡³

source: Generating quiz questions, please wait... ğğ¨ğ­ğ: ğ“ğ¡ğ¢ğ¬ ğªğ®ğ¢ğ³ ğªğ®ğğ¬ğ­ğ¢ğ¨ğ§ğ¬ ğ¢ğ¬ ğœğ«ğğšğ­ğğ ğ°ğ¢ğ­ğ¡ ğ€ğˆ, ğšğ§ğ ğ°ğ¡ğ¢ğ¥ğ ğ°ğ ğ¬ğ­ğ«ğ¢ğ¯ğ ğŸğ¨ğ« ğšğœğœğ®ğ«ğšğœğ², ğ­ğ¡ğğ«ğ'ğ¬ ğšğ¥ğ°ğšğ²ğ¬ ğš ğœğ¡ğšğ§ğœğ ğŸğ¨ğ« ğš ğ¦ğ¢ğ¬ğ­ğšğ¤ğ.
es: Generando preguntas del cuestionario, por favor espera... Nota: Las preguntas de este cuestionario se crean con IA, y aunque nos esforzamos por la precisiÃ³n, siempre existe la posibilidad de un error.

source: Congratulations! You have completed the quiz on {topic} ğŸ¯ ğ—¬ğ—¼ğ˜‚ğ—¿ ğ˜€ğ—°ğ—¼ğ—¿ğ—²: âœ… Correct answers: {cor} âŒ Incorrect answers: {incor}
es: Â¡Felicidades! Has completado el cuestionario sobre {topic} ğŸ¯ Tu puntuaciÃ³n: âœ… Respuestas correctas: {cor} âŒ Respuestas incorrectas: {incor}

source: Great job! Your performance in the quiz on {topic} is outstanding! ğŸŒŸ
es: Â¡Buen trabajo! Â¡Tu rendimiento en el cuestionario sobre {topic} es sobresaliente! ğŸŒŸ
